apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_spi.c
#ifdef CONFIG_SPI_TRIGGER
static int esp32s2_spi_trigger(struct spi_dev_s *dev)
{
  return -ENOSYS;
}
#endif

/****************************************************************************
 * Name: esp32s2_spi_dma_init
 *
 * Description:
 *   Initialize ESP32-S2 SPI connection to DMA.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if defined(CONFIG_ESP32S2_SPI2_DMA) || defined(CONFIG_ESP32S2_SPI3_DMA)
void esp32s2_spi_dma_init(struct spi_dev_s *dev)
{
  struct esp32s2_spi_priv_s *priv = (struct esp32s2_spi_priv_s *)dev;
  const uint32_t id = priv->config->id;
  uint32_t regval;
  uint32_t addr = SPI_DMA_CONF_REG(id);

  /* Enable DMA clock for the SPI peripheral */

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, priv->config->dma_clk_bit);

  /* Reset DMA for the SPI peripheral */

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, priv->config->dma_rst_bit, 0);

  /* Enable DMA burst */

  regval = SPI_OUT_DATA_BURST_EN_M |
           SPI_INDSCR_BURST_EN_M |
           SPI_OUTDSCR_BURST_EN_M;
  putreg32(regval, addr);

  /* Disable segment transaction mode for SPI Master */

  putreg32((SPI_SLV_RX_SEG_TRANS_CLR_EN_M | SPI_SLV_TX_SEG_TRANS_CLR_EN_M),
           addr);
}
#endif

/****************************************************************************
 * Name: esp32s2_spi_init
 *
 * Description:
 *   Initialize ESP32-S2 SPI hardware interface.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s2_spi_init(struct spi_dev_s *dev)
{
  struct esp32s2_spi_priv_s *priv = (struct esp32s2_spi_priv_s *)dev;
  const uintptr_t spi_user_reg = SPI_USER_REG(priv->config->id);
  const uintptr_t spi_user1_reg = SPI_USER1_REG(priv->config->id);
  const uintptr_t spi_slave_reg = SPI_SLAVE_REG(priv->config->id);
  const uintptr_t spi_misc_reg = SPI_MISC_REG(priv->config->id);
  const struct esp32s2_spi_config_s *config = priv->config;
  const uint32_t id = config->id;
  uint32_t regval;

  esp_gpiowrite(config->cs_pin, true);
  esp_gpiowrite(config->mosi_pin, true);
  esp_gpiowrite(config->miso_pin, true);
  esp_gpiowrite(config->clk_pin, true);

#if SPI_HAVE_SWCS
  esp_configgpio(config->cs_pin, OUTPUT_FUNCTION_1);
  esp_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
#endif

  /* SPI3 doesn't have IOMUX, if SPI3 is enabled use GPIO Matrix for both */

  if (esp32s2_spi_iomux(priv))
    {
#if !SPI_HAVE_SWCS
      esp_configgpio(config->cs_pin, OUTPUT_FUNCTION_5);
      esp_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
#endif
      esp_configgpio(config->mosi_pin, OUTPUT_FUNCTION_5);
      esp_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);

      esp_configgpio(config->miso_pin, INPUT_FUNCTION_5 | PULLUP);
      esp_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);

      esp_configgpio(config->clk_pin, OUTPUT_FUNCTION_5);
      esp_gpio_matrix_out(config->clk_pin, SIG_GPIO_OUT_IDX, 0, 0);
    }
  else
    {
#if !SPI_HAVE_SWCS
      esp_configgpio(config->cs_pin, OUTPUT);
      esp_gpio_matrix_out(config->cs_pin, config->cs_outsig, 0, 0);
#endif
      esp_configgpio(config->mosi_pin, OUTPUT);
      esp_gpio_matrix_out(config->mosi_pin, config->mosi_outsig, 0, 0);

      esp_configgpio(config->miso_pin, INPUT | PULLUP);
      esp_gpio_matrix_in(config->miso_pin, config->miso_insig, 0);

      esp_configgpio(config->clk_pin, OUTPUT);
      esp_gpio_matrix_out(config->clk_pin, config->clk_outsig, 0, 0);
    }

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->clk_bit);
  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->rst_bit, 0);

  regval = SPI_DOUTDIN_M | SPI_USR_MISO_M | SPI_USR_MOSI_M | SPI_CS_HOLD_M;
  putreg32(regval, spi_user_reg);
  putreg32(0, spi_user1_reg);
  putreg32(0, spi_slave_reg);
  putreg32(SPI_CS1_DIS_M | SPI_CS2_DIS_M,
           spi_misc_reg);

#if SPI_HAVE_SWCS
  esp32s2_spi_set_regbits(spi_misc_reg, SPI_CS0_DIS_M);
#endif

  putreg32(0, SPI_CTRL_REG(id));
  putreg32(VALUE_TO_FIELD(0, SPI_CS_HOLD_TIME),
           spi_user1_reg);

#if defined(CONFIG_ESP32S2_SPI2_DMA) || defined(CONFIG_ESP32S2_SPI3_DMA)
  esp32s2_spi_dma_init(dev);
#endif

  esp32s2_spi_setfrequency(dev, config->clk_freq);
  esp32s2_spi_setbits(dev, config->width);
  esp32s2_spi_setmode(dev, config->mode);
}

/****************************************************************************
 * Name: esp32s2_spi_deinit
 *
 * Description:
 *   Deinitialize ESP32-S2 SPI hardware interface.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s2_spi_deinit(struct spi_dev_s *dev)
{
  struct esp32s2_spi_priv_s *priv = (struct esp32s2_spi_priv_s *)dev;

#if defined(CONFIG_ESP32S2_SPI2_DMA) || defined(CONFIG_ESP32S2_SPI3_DMA)
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->dma_clk_bit, 0);
#endif

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, priv->config->clk_bit);
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->clk_bit, 0);

  priv->frequency = 0;
  priv->actual    = 0;
  priv->mode      = SPIDEV_MODE0;
  priv->nbits     = 0;
}

/****************************************************************************
 * Name: esp32s2_spi_interrupt
 *
 * Description:
 *   Common SPI DMA interrupt handler.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

#if defined(CONFIG_ESP32S2_SPI2_DMA) || defined(CONFIG_ESP32S2_SPI3_DMA)
static int esp32s2_spi_interrupt(int irq, void *context, void *arg)
{
  struct esp32s2_spi_priv_s *priv = (struct esp32s2_spi_priv_s *)arg;
  const uint32_t id = priv->config->id;

  /* Write 1 to clear interrupt bit */

  esp32s2_spi_set_regbits(SPI_DMA_INT_CLR_REG(id), SPI_IN_DONE_INT_CLR_M);
  nxsem_post(&priv->sem_isr);

